#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_purview_account.purviewAccount will be created
  + resource "azurerm_purview_account" "purviewAccount" {
      + atlas_kafka_endpoint_primary_connection_string   = (sensitive value)
      + atlas_kafka_endpoint_secondary_connection_string = (sensitive value)
      + catalog_endpoint                                 = (known after apply)
      + guardian_endpoint                                = (known after apply)
      + id                                               = (known after apply)
      + location                                         = "eastus2"
      + managed_resource_group_name                      = (known after apply)
      + managed_resources                                = (known after apply)
      + name                                             = "DemoTFmarcelo"
      + public_network_enabled                           = true
      + resource_group_name                              = "DemoTestRG"
      + scan_endpoint                                    = (known after apply)
      + tags                                             = {
          + "BillingCode" = "Internal"
          + "Customer"    = "Demo"
          + "Department"  = "IT"
          + "Environment" = "Development"
          + "Project"     = "Test GitHub Actions"
          + "Version"     = "1"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azurerm_resource_group.genericRG will be created
  + resource "azurerm_resource_group" "genericRG" {
      + id       = (known after apply)
      + location = "eastus2"
      + name     = "DemoTestRG"
      + tags     = {
          + "BillingCode" = "Internal"
          + "Customer"    = "Demo"
          + "Department"  = "IT"
          + "Environment" = "Development"
          + "Project"     = "Test GitHub Actions"
          + "Version"     = "1"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + purviewID = (known after apply)
  + rgName    = "DemoTestRG"
  + test      = "notused"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @Chambras, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform-Azure`*